C:\Users\alex\PycharmProjects\pythonProject\venv\Scripts\python.exe C:/Users/alex/PycharmProjects/pythonProject/hw6.py
¬ведите начальный результат в км: 8
¬ведите конечный результат в км: 25
1-ый день: 8.00 км
2-ый день: 8.80 км
3-ый день: 9.68 км
4-ый день: 10.65 км
5-ый день: 11.71 км
6-ый день: 12.88 км
7-ый день: 14.17 км
8-ый день: 15.59 км
9-ый день: 17.15 км
10-ый день: 18.86 км
11-ый день: 20.75 км
12-ый день: 22.82 км
„ерез 13 дней результат спорсмена превысит 25.0 км и составит 27.62 км

Process finished with exit code 0